w8d1/reddit_clone/app/views/posts/_form.html.erb

            <input type="hidden" name="post[sub_ids][]" value="">
            <% Sub.all.each do |sub| %>
                <label>
                  <input type="checkbox" name="post[sub_ids][]" value="<%=sub.id%>" <%= "checked" if post.sub_ids.include?(sub.id) %> >
---
SELECT "subs".* FROM "subs"
SELECT "posts".* FROM "posts"