w8d1/reddit_clone/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "sub_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "What's a Good Dog Name?"], ["content", ""], ["sub_id", 1], ["author_id", 4], ["created_at", "2020-08-24 20:22:10.162628"], ["updated_at", "2020-08-24 20:22:10.162628"]]
SELECT "posts".* FROM "posts"
---
  def create
    @post = Post.new(post_params)
    @post.author_id = current_user.id
    @post.sub_ids = post_params[:sub_ids]
    debugger
    if @post.save
      params[:post][:sub_ids].each do |sub_id|