w8d1/reddit_clone/app/controllers/subs_controller.rb

UPDATE "subs" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "subs"."id" = $4  [["title", "Dogs!"], ["description", "A place to see doggie pictures!!!!!!!!!"], ["updated_at", "2020-08-24 19:19:57.438490"], ["id", 1]]
---
    def update
        if @sub.update_attributes(sub_params)

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def get_sub
        @sub = Sub.find(params[:id])