w6d3/first_routes_and_controllers/routes_and_controllers/app/controllers/artwork_shares_controller.rb

    def create
        @artwork_share = ArtworkShare.new(artwork_shares_params)

        if @artwork_share.save
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 7], ["viewer_id", 6], ["created_at", "2020-08-13 17:38:55.153614"], ["updated_at", "2020-08-13 17:38:55.153614"]]

    def destroy
        @artwork_share = ArtworkShare.find(params[:id])
        @artwork_share.destroy
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 11]]