w6d3/first_routes_and_controllers/routes_and_controllers/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks" LEFT OUTER JOIN "artwork_shares" ON "artwork_shares"."artwork_id" = "artworks"."id" WHERE (artwork_shares.viewer_id = '10' OR artworks.artist_id = '10')
---
    def index
        # @artworks_owned = Artwork.where(artist_id: params[:user_id])

        @artworks = Artwork.left_outer_joins(:artwork_shares).where("artwork_shares.viewer_id = :user_id OR artworks.artist_id = :user_id", user_id: params[:user_id])

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["title", "808s & Heartbreak"], ["updated_at", "2020-08-13 20:32:24.557777"], ["id", 13]]
---
    def update
        @artwork = Artwork.find(params[:id])
        if @artwork.update(artwork_params)

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
---
    def destroy
        @artwork = Artwork.find(params[:id])