w6d3/first_routes_and_controllers/routes_and_controllers/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 14]]
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 16]]
---
  def index
    if params[:artwork_id]
      @comments = Comment.where(artwork_id: params[:artwork_id])
    else
      @comments = Comment.where(user_id: params[:user_id])