w7d2/music_app/app/controllers/albums_controller.rb

    def update
        if @album.update(album_params)
---
UPDATE "albums" SET "band_id" = $1, "updated_at" = $2 WHERE "albums"."id" = $3  [["band_id", 8], ["updated_at", "2020-08-19 01:12:29.463468"], ["id", 8]]

    def get_band
        @band = Band.find(params[:band_id])
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]