w7d2/music_app/app/controllers/albums_controller.rb

SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = $1  [["band_id", 6]]
---
    def index
        @albums = Album.where(band_id = @band.id)