w7d2/music_app/app/views/albums/_form.html.erb

SELECT "bands".* FROM "bands"
---
    <br>
    <% Band.all.each do |artist| %>