w6d4/ninety_nine_cats/app/controllers/cats_controller.rb

    def index
        @cat = Cat.all
---
SELECT "cats".* FROM "cats"